import PageNavigation from "../../Components/PageNavigation/PageNavigation";
import Questions from "../../Components/Questions/Questions";
import "./Returning.scss";

const Returning: React.FC = () => {
  return (
    <>
      <PageNavigation
        linkText="Повернення товару"
        homeLink="/"
        linkHref="/return-of-goods"
      />

      <div className="returning">
        <div className="returning__container">
          <div className="returning__questions">
            <Questions />
          </div>

          <div className="returning__text">
            <h1>Повернення товару</h1>
            <p>
              У відповідності до Додатку №3 до Постанови Кабінету Міністрів
              України від 19.03.94 №172 «Про реалізацію окремих положень Закону
              України «Про захист прав споживачів» натільна білизна та
              панчішно-шкарпеткові вироби віднесені до Переліку товарів,
              належної якості, що не підлягають обміну (поверненню).{" "}
              <span>
                Але як клієнтоорієнтовна компанія ми надаємо можливість
                повернення.
              </span>
            </p>

            <h2>Правила повернення</h2>
            <p>
              Якщо протягом чотирнадцяти днів куплений товар не влаштовує за
              розміром, фасоном або кольором, Покупець, за умови, що товар не
              був у користуванні, збережений його товарний вигляд, споживчі
              якості та цілісність пакування, може повернути його Продавцю.
              <br />
              <br />
              Продавець повертає сплачені кошти, у разі повного відмовлення від
              замовлення, та, за бажанням, робить заміну товару на інший за
              вибором Покупця з оплатою замовлення до чи після його виконання.
            </p>
            <br />
            <ul>
              <li>
                Покупець має право відмовитися від отриманого товару неналежної
                якості протягом чотирнадцяти днів, рахуючи з дня отримання
                товару, за умови збереження упаковки, товарного вигляду,
                споживчих якостей та супровідних документів на товар.
              </li>
              <li>
                У разі відмови Покупця від посилки, відправлення повертається
                відправнику, тобто Продавцю.
              </li>
            </ul>

            <h3>Повернення товару належної якості</h3>
            <p>
              Товар можна повернути за адресою: Відділення Нової Пошти №2, м.
              Червоноград (Львівська область)
              <br />
              <br />
              Інформація про одержувача — Ткаченко Олександр Констянтинович
              +380&nbsp;(98)&nbsp;326&nbsp;48&nbsp;72
            </p>

            <ul>
              <li>
                У посилку вложіть № декларації надісланої посилки та №
                банківської картки для повернення вартості товар;
              </li>
              <li>
                після отримання, перевірки вмісту посилки на відповідність
                умовам повернення товару, ми повертаємо Вам гроші на банківську
                карту або надсилаємо інший товар протягом трьох робочих днів.
              </li>
            </ul>
            <br />
            <p><span>Послуги перевізника оплачуються за рахунок Покупця.</span></p>

            <h3>Повернення товару неналежної якості</h3>
            <p>
              Якщо на момент обміну аналогічного товару немає у продажу,
              споживач має право або придбати будь-який інший товар з наявного
              асортименту з відповідним перерахунком вартості, або розірвати
              договір та одержати назад гроші у розмірі вартості повернутого
              товару, або здійснити обмін товару на аналогічний при першому ж
              надходженні відповідного товару в продаж.
            </p>
            <ul>
              <li>
                У посилку вложіть № декларації надісланої посилки та №
                банківської картки для повернення вартості товар;
              </li>
              <li>
                після отримання, перевірки вмісту посилки на відповідність
                умовам повернення товару, ми повертаємо Вам гроші на банківську
                карту або надсилаємо інший товар протягом трьох робочих днів.
              </li>
            </ul>
            <br />
            <p><span>Послуги перевізника оплачуються за рахунок Покупця.</span></p>
          </div>
        </div>
      </div>
    </>
  );
};

export default Returning;
